package ru.zharinov.tasks.basic_exercises.task_01;
/*
Напишите программу на Java, которая напечатает «Hello» на экране, а затем напечатайте свое имя в отдельной строке.
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello,\nZharinov Ilia");
    }
}
