package ru.zharinov.tasks.basic_exercises.task_list_3;
/*
Напишите программу на Java для печати значения ascii данного символа.
Ожидаемый результат

Значение ASCII Z: 90
 */
public class Task_41 {
    public static void main(String[] args) {
        char s = 'Z';
        System.out.println((int) s);
    }
}
