package ru.zharinov.tasks.basic_exercises.task_list_3;

/*
Напишите программу на Java для печати следующей строки в определенном формате (см. Вывод).
Пример вывода

Мерцание, мерцание, маленькая звезда,
    Как я жажду узнать, кто ты!
        Подняться над миром так высоко,
        Как алмаз в небе.
Мерцание, мерцание, маленькая звезда,
    Как я жажду узнать, кто ты
 */
public class Task_43 {
    public static void main(String[] args) {
        System.out.println("\nTwinkle, twinkle, little star, \n\tHow I wonder what you are! " +
                "\n\t\tUp above the world so high, \n\t\tLike a diamond in the sky. \nTwinkle, twinkle, little star, " +
                "\n\tHow I wonder what you are!\n\n");
    }
}
