package ru.zharinov.tasks.basic_exercises.task_03;

/*
Напишите программу на Java, чтобы разделить два числа и напечатать на экране.

Тестовые данные:
50/3
Ожидаемый результат :
16
 */
public class Main {
    public static void main(String[] args) {
        int number = 50;
        int number2 = 3;
        int result = number / number2;
        System.out.println("difference of numbers = " + result);
    }
}
