package ru.zharinov.tasks.basic_exercises.task_list_1;
/*
Напишите программу на Java, которая напечатает «Hello» на экране, а затем напечатайте свое имя в отдельной строке.

Ожидаемый результат :
Привет
Александра Абрамова
 */
public class Task01 {
    public static void main(String[] args) {
        System.out.println("Hello,\nZharinov Ilia");
    }
}
