package ru.zharinov.tasks.basic_exercises.task_list_1;

/*
Напишите программу на Java для отображения следующего шаблона.
Образец шаблона:

 J avva J aavvaa
JJ ааааа В.В. ааааа
 Джей Джей Ва
 */
public class Task08 {
    public static void main(String[] args) {
        System.out.println(" J avva J aavvaa\n" +
                "JJ ааааа В.В. ааааа\n" +
                " Джей Джей Ва");
    }
}
